### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.website.module.cdn.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E1JJ5NAYUQCPD6"
        tags                           = {}
+       web_acl_id                     = (known after apply)
        # (20 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.website.module.waf.aws_wafv2_web_acl.default[0] must be replaced
-/+ resource "aws_wafv2_web_acl" "default" {
      ~ arn         = "arn:aws:wafv2:us-west-2:357150818708:regional/webacl/gost-staging/d0a3acb8-1ece-43c3-93fc-bcfbdb0603b4" -> (known after apply)
      ~ capacity    = 975 -> (known after apply)
      ~ id          = "d0a3acb8-1ece-43c3-93fc-bcfbdb0603b4" -> (known after apply)
      ~ lock_token  = "6278646d-281f-41b5-b0ab-c1f82e20aa29" -> (known after apply)
        name        = "gost-staging"
      ~ scope       = "REGIONAL" -> "CLOUDFRONT" # forces replacement
        tags        = {
            "Name"      = "gost-staging"
            "Namespace" = "gost-staging"
        }
        # (2 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>

*Pusher: @slapula, Action: `pull_request`, Workflow: `Terraform CI`*